//ADJBATCH PROC DB2SSID=DB2T,PLAN=ADJPLAN
//RUN      EXEC PGM=ADJBAT01,REGION=0M,
//         PARM='&DB2SSID,&PLAN'
//STEPLIB  DD  DSN=DEMO.LOAD,DISP=SHR
//         DD  DSN=DB2T.SDSNLOAD,DISP=SHR
//ADJIN    DD  DSN=DEMO.ADJIN(0),DISP=SHR
//ADJOUT   DD  DSN=DEMO.ADJOUT(+1),DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(CYL,(1,1)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//SYSOUT   DD  SYSOUT=*
//         PEND